InformationRegisters/Логи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Логи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БлокировкиБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>БлокировкиБаз</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБлокировокБаз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершениеРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОчисткаРегистров/Ext/Module.bsl
&НаСервере
Процедура УдалениеСтарыхЛогов() Экспорт 
	
	Дата = ТекущаяДата() - Константы.ДнейХраненияЛогов.Получить()*24*60*60;
	
	Набор = РегистрыСведений.Логи.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Логи.Период,
		|	Логи.База,
		|	Логи.Лог,
		|	Логи.Результат,
		|	Логи.ДатаОкончания,
		|	Логи.Пользователь
		|ИЗ
		|	РегистрСведений.Логи КАК Логи
		|ГДЕ
		|	Логи.Период >= &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Выгрузка  = Запрос.Выполнить().Выгрузить();
	Набор.Загрузить(Выгрузка);
	Набор.Записать(Истина);
	
	Набор = РегистрыСведений.БлокировкиБаз.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкиБаз.Период,
		|	БлокировкиБаз.База,
		|	БлокировкиБаз.Состояние,
		|	БлокировкиБаз.ЗавершениеРаботы,
		|	БлокировкиБаз.Пользователь
		|ИЗ
		|	РегистрСведений.БлокировкиБаз КАК БлокировкиБаз
		|ГДЕ
		|	БлокировкиБаз.Период >= &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Выгрузка  = Запрос.Выполнить().Выгрузить();
	Набор.Загрузить(Выгрузка);
	Набор.Записать(Истина);
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьЛога(База, Дата) Экспорт
	
	Набор = РегистрыСведений.Логи.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Значение = Дата;
	Набор.Отбор.Период.Использование = Истина;
	Набор.Отбор.База.Значение = База;
	Набор.Отбор.База.Использование = Истина;
	Набор.Записать(Истина);
	
КонецПроцедуры
